zephyrproject-rtos/zephyr/include/drivers/clock_control/stm32f3_clock_control.h
/*
 * Copyright (c) 2016 RnDity Sp. z o.o.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#ifndef _STM32F3_CLOCK_CONTROL_H_
#define _STM32F3_CLOCK_CONTROL_H_

/**
 * @file
 *
 * @brief Clock subsystem IDs for STM32F3 family
 */

/* APB1 */
#define STM32F3X_CLOCK_SUBSYS_TIM2	(1 << 0)
#define STM32F3X_CLOCK_SUBSYS_TIM3	(1 << 1)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_TIM4	(1 << 2)
#endif
#ifdef CONFIG_SOC_STM32F373XC
#define STM32F3X_CLOCK_SUBSYS_TIM5	(1 << 3)
#endif
#define STM32F3X_CLOCK_SUBSYS_TIM6	(1 << 4)
#define STM32F3X_CLOCK_SUBSYS_TIM7	(1 << 5)
#ifdef CONFIG_SOC_STM32F373XC
#define STM32F3X_CLOCK_SUBSYS_TIM12	(1 << 6)
#define STM32F3X_CLOCK_SUBSYS_TIM13	(1 << 7)
#define STM32F3X_CLOCK_SUBSYS_TIM14	(1 << 8)
#define STM32F3X_CLOCK_SUBSYS_TIM18	(1 << 9)
#endif
#define STM32F3X_CLOCK_SUBSYS_WWDG	(1 << 11)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_SPI2	(1 << 14)
#define STM32F3X_CLOCK_SUBSYS_SPI3	(1 << 15)
#endif
#define STM32F3X_CLOCK_SUBSYS_USART2	(1 << 17)
#define STM32F3X_CLOCK_SUBSYS_USART3	(1 << 18)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_UART4	(1 << 19)
#define STM32F3X_CLOCK_SUBSYS_UART5	(1 << 20)
#endif
#define STM32F3X_CLOCK_SUBSYS_I2C1	(1 << 21)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_I2C2	(1 << 22)
#define STM32F3X_CLOCK_SUBSYS_USB	(1 << 23)
#endif
#define STM32F3X_CLOCK_SUBSYS_CAN	(1 << 25)
#define STM32F3X_CLOCK_SUBSYS_DAC2	(1 << 26)
#define STM32F3X_CLOCK_SUBSYS_PWR	(1 << 28)
#define STM32F3X_CLOCK_SUBSYS_DAC1	(1 << 29)

#define STM32F3X_CLOCK_APB2_BASE	(1 << 30)

/* APB2 */
#define STM32F3X_CLOCK_SUBSYS_SYSCFG	(STM32F3X_CLOCK_APB2_BASE | 1 << 0)
#ifndef CONFIG_SOC_STM32F373XC
#define STM32F3X_CLOCK_SUBSYS_TIM1	(STM32F3X_CLOCK_APB2_BASE | 1 << 11)
#endif
#define STM32F3X_CLOCK_SUBSYS_SPI1	(STM32F3X_CLOCK_APB2_BASE | 1 << 12)
#ifdef CONFIG_SOC_STM32F303XC
#define STM32F3X_CLOCK_SUBSYS_TIM8	(STM32F3X_CLOCK_APB2_BASE | 1 << 13)
#endif
#define STM32F3X_CLOCK_SUBSYS_USART1	(STM32F3X_CLOCK_APB2_BASE | 1 << 14)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_SPI4	(STM32F3X_CLOCK_APB2_BASE | 1 << 15)
#endif
#define STM32F3X_CLOCK_SUBSYS_TIM15	(STM32F3X_CLOCK_APB2_BASE | 1 << 16)
#define STM32F3X_CLOCK_SUBSYS_TIM16	(STM32F3X_CLOCK_APB2_BASE | 1 << 17)
#define STM32F3X_CLOCK_SUBSYS_TIM17	(STM32F3X_CLOCK_APB2_BASE | 1 << 18)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_TIM19	(STM32F3X_CLOCK_APB2_BASE | 1 << 19)
#endif
#ifdef CONFIG_SOC_STM32F303XC
#define STM32F3X_CLOCK_SUBSYS_TIM20	(STM32F3X_CLOCK_APB2_BASE | 1 << 20)
#endif
#ifdef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_HRTIMER1	(STM32F3X_CLOCK_APB2_BASE | 1 << 29)
#endif
#define STM32F3X_CLOCK_AHB_BASE		(1 << 31)

/* AHB */
#define STM32F3X_CLOCK_SUBSYS_DMA1	(STM32F3X_CLOCK_AHB_BASE | 1 << 0)

#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_DMA2	(STM32F3X_CLOCK_AHB_BASE | 1 << 1)
#endif
#define STM32F3X_CLOCK_SUBSYS_SRAM	(STM32F3X_CLOCK_AHB_BASE | 1 << 2)
#define STM32F3X_CLOCK_SUBSYS_FLITF	(STM32F3X_CLOCK_AHB_BASE | 1 << 4)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_FMC	(STM32F3X_CLOCK_AHB_BASE | 1 << 5)
#endif
#define STM32F3X_CLOCK_SUBSYS_CRC	(STM32F3X_CLOCK_AHB_BASE | 1 << 6)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_IOPH	(STM32F3X_CLOCK_AHB_BASE | 1 << 16)
#endif
#define STM32F3X_CLOCK_SUBSYS_IOPA	(STM32F3X_CLOCK_AHB_BASE | 1 << 17)
#define STM32F3X_CLOCK_SUBSYS_IOPB	(STM32F3X_CLOCK_AHB_BASE | 1 << 18)
#define STM32F3X_CLOCK_SUBSYS_IOPC	(STM32F3X_CLOCK_AHB_BASE | 1 << 19)
#define STM32F3X_CLOCK_SUBSYS_IOPD	(STM32F3X_CLOCK_AHB_BASE | 1 << 20)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_IOPE	(STM32F3X_CLOCK_AHB_BASE | 1 << 21)
#endif
#define STM32F3X_CLOCK_SUBSYS_IOPF	(STM32F3X_CLOCK_AHB_BASE | 1 << 22)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_IOPG	(STM32F3X_CLOCK_AHB_BASE | 1 << 23)
#endif
#define STM32F3X_CLOCK_SUBSYS_TSC	(STM32F3X_CLOCK_AHB_BASE | 1 << 24)
#define STM32F3X_CLOCK_SUBSYS_ADC12	(STM32F3X_CLOCK_AHB_BASE | 1 << 28)
#ifndef CONFIG_SOC_STM32F334X8
#define STM32F3X_CLOCK_SUBSYS_ADC34	(STM32F3X_CLOCK_AHB_BASE | 1 << 29)
#endif

#endif /* _STM32F3_CLOCK_CONTROL_H_ */
